;1.1 Что выведут следующие выражения,

10 ;10

(+ 5 3 4) ;12

(- 9 1) ;8

(/ 6 2) ;3

(+ (* 5 5) (- 4 8)) ;21

(define a 3) ;3

(define b (+ a 1)) ;4

(+ a b (* b a)) ;19

(= a b)  ;#false

(if (and (> b a) (< b (* a b)))
      b
      a) ;4

(cond ((= a 4) 6)
      ((= b 4) (+ 1 7 a))
      (else 25)) ;12

(+ 2 (if (< b a) b a)) ;5

(* (cond((> a b) a)
        ((< a b) b)
        (else -1))
        (+ a 2)) ;20


;1.2 Перевести выражение в префиксную форму

(/ (+ 5 4 
        (- 2 
            (- 3 
                (+ 5 
                    (/ 4 5))))) 
    (* 3 
        (- 6 2) (- 2 7))) ; -0.23

